{
    "tasks": [
        {
            "id": 0,
            "title": "Task #1 (In Class)",
            "description": "Get images using useEffect hook and fetch."
        },
        {
            "id": 1,
            "title": "Task #2 (In Class)",
            "description": "Input Focus"
        },
        {
            "id": 2,
            "title": "Task #3 (In Class)",
            "description": "Timer using useEffect and useRef"
        },
        {
            "id": 3,
            "title": "Task #4 (In Class)",
            "description": "Валідація полів. Є два поля. При натисненні на кнопку перевіряти чи поле порожнє. Якщо поле порожнє, то ставити туди курсор."
        },
        {
            "id": 4,
            "title": "Task #5 (In Class)",
            "description": "Counter з підпискою (через кожну секунду виводити значення у консоль)"
        },
        {
            "id": 5,
            "title": "Task #6 (In Class)",
            "description": "З клавіатури вводиться довжина у сантиметрах. Виводити скільки це метрів, кілометрів."
        },
        {
            "id": 6,
            "title": "Task #7 (In Class)",
            "description": "[JS Saper] Однорядковий сапер. Однорядкова таблиця, до клітинок якої додано інформацію про наявність міни (використати атрибути). Спочатку клітинки сірі. При натисненні на клітинку аналізується чи є там міна і тоді колір стає червоним, якщо немає – зеленим. Додати можливість відкриття усіх сусідніх незамінованих клітинок при відкритті незамінованої клітинки."
        },
        {
            "id": 7,
            "title": "Task #8 (In Class)",
            "description": "[React Saper] Однорядковий сапер. Однорядкова таблиця, до клітинок якої додано інформацію про наявність міни (використати атрибути). Спочатку клітинки сірі. При натисненні на клітинку аналізується чи є там міна і тоді колір стає червоним, якщо немає – зеленим. Додати можливість відкриття усіх сусідніх незамінованих клітинок при відкритті незамінованої клітинки."
        },
        {
            "id": 8,
            "title": "",
            "description": " З клавіатури вводиться температура. Змінювати колір фону у залежності від значення:\nменше нуля – білий\nвід 0 до 10 – синій,\nвід 11 до 22 – зелений\nвище 22 – червоний\nРеалізувати з класами і стилями."
        },
        {
            "id": 9,
            "title": "",
            "description": "Вводиться дозволена швидкість і поточна швидкість авто. Якщо не введено дозволену швидкість, то елемент введення поточної швидкості заблокований. Якщо швидкість менше 50% дозволеної, то колір input – оранжевий, якщо від 50% до 100% - зелений, вище 100% - червоний. Якщо значення вище 90% починає блимати повідомлення «Увага!»"
        },
        {
            "id": 10,
            "title": "",
            "description": "Дано список спортсменів. Потрібно сформувати список тих, які будуть брати участь у змаганні. При цьому є два стовпці. В одному відображені всі спортсмени, в іншому – список тих, хто був вибраний. При натисканні на зелену стрілку спортсмен переміщається у список для змагань. При натисканні на червону стрілку спортсмен переміщається у загальний список."
        },
        {
            "id": 11,
            "title": "",
            "description": "Пари для танців. Поступово вибираємо хлопця, дівчину і додаємо у обрані пари. Пару можна видалити. Поки не вибрано хлопця і дівчину кнопка «Додати» заблокована.  Якщо не вистачає хлопців або дівчат вибір також блокується."
        }
    ]
}
