//* На кухню поступають замовлення. Спочатку ми додаємо їх у список
//*  “Очікують на виконання”, якщо повар береться робити — замовлення
//*  переходить у список “Виконуються”, якщо замовлення виконано — переходить
//* у список “Готові до виносу”. Якщо натиснути на “Подано” - страва зникає з таблиці.
//* Підказка: тут треба зберігати 3 масиви страв ( waitingList, processingList, completedList)

function Kitchen() {
  return <div>Kitchen</div>
}

function TaskSolution6() {
  return (
    <div>
      <Kitchen />
    </div>
  )
}

export default TaskSolution6
